/***********************************************************************************************
                        杭州电子科技大学 智能车（光电）K66例程（V1.0）
												                     发布时间：2017年11月19日
须知：1、本例程适用K66FX1M0VLQ18芯片，其他K66系列芯片暂未测试。
			2、本例程通过逐飞科技K66MDK库更改而成，并借鉴了超核K60库的相关文件。
			3、目前已知bug：（1）目前SD卡仅可录图、在OLED上显示之前的图像，传图像到上位机请使用K60。
											（2）FTM模块仅可以使用FTM0 FTM1 FTM2 模块，FTM3模块不可用。
											（3）SD卡使用标准SD卡协议，可能时序较慢。
更新说明：1、测试ADC模块，并修改时钟分频；（2018.2.26）
					2、替换了逐飞oled函数库，使用旧库oled函数，优化了时序；（2018.2.26）
					3、移植旧库flash读取函数，但尚未测试。（2018.2.26）
***********************************************************************************************/  
#include "headfile.h"
#include "extern.h"

#include "menu.h"             //菜单
#include "image_process.h"    //图像处理(上位机图像)
#include "my_imagetransfer.h"	//sd卡
#include "control.h"		      //控制
//unlock kinetis
/*            外部引用参数          */
/*             摄像头 数组 行距 参数                 */
#if(1)

uint8_t yuzhi=80;//摄像头阈值
int yuzhi_Max=254;//大津法阈值限制最大值
int yuzhi_Min=0;//大津法阈值限制最小值
int podao_yuzhimax=70;//坡道大津法阈值限辐
//新架的备车 18.8.2
byte hangju2[70]=
{
92,90,89,87,86,84,82,80,79,77,
75,73,72,70,68,67,65,63,61,59,
57,55,53,52,50,48,46,44,42,40,
39,37,35,33,31,29,27,26,23,21,
20,18,16,13,12,9,7,4,2,0,
0,0,0,0,0,0,0,0,0,0,
0,0,0,0,0,0,0,0,0,0,
};
byte fixvalue2[70]=
{
184,181,178,175,172,168,164,160,158,154,
150,147,144,140,136,134,130,126,122,118,
115,111,107,104,100,96,93,89,85,81,
78,75,71,66,62,59,55,52,47,43,
40,36,32,27,24,19,14,9,4,1,
1,1,1,1,1,1,1,1,1,1,
  1,1,1,1,1,1,1,1,1,1,
};
byte hangju1[70]=
{
92,91,90,88,86,84,83,81,79,77,
75,73,72,70,68,66,64,62,61,59,
57,54,52,51,49,47,45,43,41,39,
37,35,33,32,30,28,26,24,22,20,
18,16,14,12,10,7,4,0,0,0,
0,0,0,0,0,0,0,0,0,0,
0,0,0,0,0,0,0,0,0,0,
};
byte fixvalue1[70]=
{
    185,183,180,176,173,169,166,162,158,154,
    150,147,144,140,136,133,129,125,122,118,
    114,109,105,102,99,95,91,87,83,79,
    75,71,67,64,60,56,52,48,44,41,
    36,33,29,25,20,15,8,1,1,1,
    1,1,1,1,1,1,1,1,1,1,
  1,1,1,1,1,1,1,1,1,1,
};
byte hangju0[70]=
{
92,91,89,88,86,84,82,80,78,76,
74,72,70,69,67,65,63,61,59,57,
55,53,51,49,47,45,43,41,40,38,
36,34,32,30,28,26,24,23,21,18,
16,13,12,10,8,3,0,0,0,0,
0,0,0,0,0,0,0,0,0,0,
0,0,0,0,0,0,0,0,0,0
};
byte fixvalue0[70]=
{
185,182,179,176,172,168,165,161,157,153,
149,145,141,138,134,130,126,122,119,114,
110,106,102,99,95,91,87,83,80,76,
73,69,65,61,57,53,49,46,43,36,
32,26,24,21,16,6,1,1,1,1,
1,1,1,1,1,1,1,1,1,1,
1,1,1,1,1,1,1,1,1,1,
};
//蓝车
byte hangju3[70]=
{
91,89,87,86,84,82,80,78,76,74,
72,70,68,66,64,62,60,58,56,54,
51,49,49,47,45,43,42,40,37,36,
34,31,30,28,26,24,22,20,18,16,
14,12,10,8,3,0,0,0,0,0,
0,0,0,0,0,0,0,0,0,0,
0,0,0,0,0,0,0,0,0,0,
};
byte fixvalue3[70]=
{
183,179,175,172,168,164,160,156,153,149,
144,140,136,132,129,124,120,116,112,108,
103,99,98,94,90,86,84,80,75,72,
68,63,61,56,53,49,44,40,37,32,
28,25,21,17,6,1,1,1,1,1,
1,1,1,1,1,1,1,1,1,1,
1,1,1,1,1,1,1,1,1,1,
};
#endif




int CNT = 0;//帧数记录

uint16_t battery_voltage = 0;//电池电压

uint8 Receive_Flag=0;//NRF2401 接收数据成功标志位

uint32_t duoji_InitalDuty;//舵机占空比赋值

uint8_t youhuan=0;//右环阶段标志位
uint8_t zuohuan=0;//左环阶段标志位

uint8_t dianbo_jishu=0;//颠簸计数
int xiaosadd=0;//小S加速值

uint8_t already_huiche=0;//中间会车标志位
int tingjichang=0;//会车停车计场

uint8 dangche=0;//单双车开关
uint8_t Car=0;//车标志
uint8_t TuBianYuZhi=0;//会车区虚线判定设定值
int init_dianji=0;;//会车停车初始占空比赋值

int Start_error=0;//起始会车平移边线距离
int Mid_error=0;//中间会车平移边线距离
int End_error=0;//最后会车平移边线距离

uint8_t  small_s_no_xuxian=0;//小S不判虚线开关

uint16_t falsh_buffer[170];//Flash存储数组
int Flash_Num=0;//不同速度档位的Flash扇区号
uint8_t sdMode=1;//菜单模式
uint8_t Menu_Mode = 0;//菜单进程序标志位
uint8_t flash_flag=0;//存储数据标志位

uint16_t D=45;//环岛D
uint8_t chasup=6;//差速系数
uint16_t duojiZhongZhi=1500;//舵机中值

uint8_t quanNum=0;//赛道圈数
uint8_t quanDirection=0;//环岛参数颠倒标志位 按1按左键
uint8_t huannum=0;//环岛数量

uint8_t podao_one=0;//判第一个坡
uint8_t podao_two=0;//判第二个坡
uint8_t podao_three=0;//判第三个坡

uint8_t protect_flag=0;//保护标开关
uint8_t oled_flag=0;//显示屏开关
uint8_t sd_Flag=0;//SD卡开关
uint8_t camera_Flag=0;//摄像头图像开关

uint8_t pan_huanahead=0;//直道接环岛开关
uint8_t podao_danbanF=0;//待用
uint8_t podaoF=0;//坡道开关
uint8_t podao_xuxian=0;//虚线后坡道开关
uint8_t podao_GroyNeed=0;
uint8_t dianboF=0;//颠簸开关
uint8_t huan_after_dianbo=0;//颠簸后有环岛开关
uint8_t huan_after_podao=0;//颠簸后有环岛开关
uint8_t huiche_alllost_flag=0;//会车区两边都丢线开关
uint8_t small_s_mend=0;//小S补线开关
uint8_t xie_huan_flag=0;//斜入环判断开关
uint8_t huan_nei_white=0;//环内白色是否判环开关
uint8_t All_white_PanPo=0;//赛道全白判坡
uint8_t dianbo_xueruo=0;//颠簸靠陀螺仪检测时开启削弱条件
int main(void)
{
}

